Tutorial/OF9/secondaryTwoPhase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     potentialMultiphaseEulerFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.001;//

writeControl    adjustableRunTime;//runTime;

writeInterval   1;

purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;//1

maxDeltaT       1;

libs
(
 "libeulerianInterfacialModelsPropios.so"
);

functions
{
    #includeFunc fieldAverage(U.gas, U.liquid, alpha.gas) 
    
    #includeFunc    phaseForces(phase=liquid)
    #includeFunc    graphUniform_up

    
    fieldAverage1
        {
                            type                    fieldAverage;
            functionObjectLibs ( "libfieldFunctionObjects.so" );
            enabled               true;
	    writeControl          writeTime;	
	    //windowType   	  exact;
            //window                0.01;
            timeStart             0.0;//0.1;
            periodicRestart       true;
            restartPeriod         0.1;
            //timeEnd               20;
                
            fields
            (
                keff
                {
                    mean           on;
                    prime2Mean     off;
                    base           time;
                }

                fi
                {
                    mean           on;
                    prime2Mean     off;
                    base           time;
                }
            );
        }

}


// ************************************************************************* //
