Tutorial/OF9/secondaryTwoPhase/0/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform (0 0 0.02);  
    }
    outlet
    {
	type               pressureInletOutletVelocity;
        phi                phi.liquid;
        value              $internalField;
    }
    wall_cathode
    {
        type               noSlip;
    }
    wall_anode
    {
        type               noSlip;
    }
    wall_isolation
    {
    	type               noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
