Tutorial/OF9/secondaryTwoPhase/0/f.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform 1.0;//$internalField;
    }
    outlet
    {
        //type            zeroGradient;
        type            inletOutlet;
        phi             phi.gas;
        inletValue      $internalField;
        value           $internalField;
    }
    "wall_.*"
    {
        //type            zeroGradient;
        type            fixedValue;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
