Tutorial/OF9/secondaryTwoPhase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;//backward;//
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default                         none;
    "div\(phi,alpha.*\)"            Gauss vanLeer;
    "div\(phir,alpha.*\)"           Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss linearUpwind limited;//Gauss upwind;//
    "div\(phi.*,U.*\)"              Gauss linearUpwind limited;//Gauss upwind;//

    //"div\(alphaRhoPhi.*,Yi\)"       Gauss linearUpwind limited;
    "div\(alphaRhoPhi.*,(h|e).*\)"  Gauss limitedLinear 1; //Gauss linearUpwind limited;//Gauss upwind;//
    "div\(alphaPhi.*,f.*\)"         Gauss limitedLinear 1; //Gauss linearUpwind limited;//Gauss upwind;//
    "div\(alphaRhoPhi.*,K.*\)"      Gauss upwind;//Gauss linearUpwind limited;
    "div\(alphaRhoPhi.*,\(p\|thermo:rho.*\)\)" Gauss linearUpwind limited;//Gauss upwind;//
    "div\(alphaRhoPhi.*,(k|epsilon|omega).*\)"  Gauss linearUpwind limited;//Gauss upwind;//
    "div\(phim,(k|epsilon)m\)"      Gauss upwind;//Gauss linearUpwind limited;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)\*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
    
    

    /*"div\(phi,alpha.*\)"            Gauss vanLeer;
    "div\(phir,alpha.*,alpha.*\)"   Gauss vanLeer;
    "div\(phir,alpha.*\)"           Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss linearUpwind limited;//Gauss limitedLinearV 1;
    "div\(phi.*,U.*\)"              Gauss linearUpwind limited;//Gauss limitedLinearV 1;

    "div\(alphaRhoPhi.*,(h|e|f).*\)"  Gauss limitedLinear 1; //Gauss linearUpwind limited;//
    "div\(alphaPhi.*,p\)"           Gauss linearUpwind limited;//Gauss limitedLinear 1;
    "div\(alphaPhi.*,f.*\)"         Gauss linearUpwind limited;
     "div\(alphaRhoPhi.*,(k|epsilon|omega).*\)"  Gauss linearUpwind limited;//Gauss upwind;
    "div\(phim,(k|epsilon)m\)"      Gauss upwind;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;*/
}

laplacianSchemes
{
    default         Gauss linear corrected;//uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;//uncorrected;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}
// ************************************************************************* //
