Tutorial/OF9/secondaryTwoPhase/system/totalCurrentDensityAverage
//*--------------------------------*- C++ -*----------------------------------*\
//| =========                 |                                                 |
//| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
//|  \\    /   O peration     | Version:  5                                     |
//|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
//|    \\/     M anipulation  |                                                 |
//\*---------------------------------------------------------------------------*/
 
totalCurrentDensityAverage
{
        type        potentialWallFluxAverage;//
        libs        ("libpotentialWallFluxAverageFunctionObject.so");//
	patches     ("wall_cathode" "wall_anode");

}

//\*---------------------------------------------------------------------------*/

